astb_relise/src/Documents/УстановкаШтрихкодовНоменклатуры/УстановкаШтрихкодовНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УстановкаШтрихкодовНоменклатуры</name>
  <basedOn>Document.ВыдачаСредствЗащитыСотруднику</basedOn>
  <registerRecords>InformationRegister.ШтрихкодыНоменклатурыДляУчетаЧистки</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СоздательДокумента</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>МВЗ</name>
    <type>
      <types>CatalogRef.МВЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидВыдачиСИЗ</name>
    <type>
      <types>EnumRef.ВидыВыдачиСИЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ВыдачаСредствЗащитыСотруднику</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ШтрихкодыНоменклатуры</name>
    <attributes>
      <name>Штрихкод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНоменклатуры</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаВыдачи</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

astb_relise/src/AccumulationRegisters/ВыданныеСредстваЗащиты/ВыданныеСредстваЗащиты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВыданныеСредстваЗащиты</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>НеВыводитьВыдачуВ_ЛК</name>
    <comment>АСТБ_Горюшин_Алексей_19561</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НормаВыдачи</name>
    <type>
      <types>CatalogRef.НормыВыдачиСИЗ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НоменклатураНормы</name>
    <type>
      <types>CatalogRef.НоменклатураНормОрганизации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХарактеристикаНоменклатуры</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаВыдачи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ПроцентИзноса</name>
    <type>
      <types>CatalogRef.ПроцентыИзноса</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

astb_relise/src/InformationRegisters/ШтрихкодыНоменклатурыДляУчетаЧистки/ШтрихкодыНоменклатурыДляУчетаЧистки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ШтрихкодыНоменклатурыДляУчетаЧистки</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </resources>
  <resources>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </resources>
  <resources>
    <name>МВЗ</name>
    <type>
      <types>CatalogRef.МВЗ</types>
    </type>
  </resources>
  <resources>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </resources>
  <resources>
    <name>ХарактеристикаНоменклатуры</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </resources>
  <resources>
    <name>ДатаВыдачи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Штрихкод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

astb_relise/src/Enums/ВидыВыдачиСИЗ/ВидыВыдачиСИЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыВыдачиСИЗ</name>
  <enumValues>
    <name>КоллективнаяВыдача</name>
  </enumValues>
  <enumValues>
    <name>ПерсональнаяВыдача</name>
  </enumValues>
  <enumValues>
    <name>ПроизвольнаяВыдача</name>
  </enumValues>
  <enumValues>
    <name>УпрощеннаяВыдача</name>
  </enumValues>
</mdclass:Enum>

astb_relise/src/Documents/ВыдачаСредствЗащитыСотруднику/ВыдачаСредствЗащитыСотруднику.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВыдачаСредствЗащитыСотруднику</name>
  <basedOn>Catalog.Сотрудники</basedOn>
  <basedOn>Document.ЗаявкаНаПроизвольнуюВыдачуСИЗ</basedOn>
  <basedOn>Document.ВыдачаСредствЗащитыСотруднику</basedOn>
  <basedOn>Document.ОбращениеНаСклад</basedOn>
  <registerRecords>InformationRegister.КодыМаркировкиВыданныхСредствЗащиты</registerRecords>
  <registerRecords>AccumulationRegister.ВыданныеСредстваЗащиты</registerRecords>
  <registerRecords>AccumulationRegister.ЗаявкиНаВыдачу</registerRecords>
  <registerRecords>AccumulationRegister.ПотребностьВыдачиСИЗ</registerRecords>
  <registerRecords>InformationRegister.СрокиНоскиПоУпрощеннойВыдаче</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиНоменклатуры</registerRecords>
  <registerRecords>AccumulationRegister.ВыдачаПоПотребности</registerRecords>
  <registerRecords>InformationRegister.ИсторияОбращенийНаСклад</registerRecords>
  <registerRecords>AccumulationRegister.СредстваЗащитыКПолучению</registerRecords>
  <registerRecords>InformationRegister.ШтрихкодыНоменклатурыДляУчетаЧистки</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СоздательДокумента</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидВыдачиСИЗ</name>
    <type>
      <types>EnumRef.ВидыВыдачиСИЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ОбращениеНаСклад</types>
      <types>DocumentRef.ВыдачаСредствЗащитыСотруднику</types>
      <types>DocumentRef.ЗаявкаНаПроизвольнуюВыдачуСИЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Заказчик</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>МВЗ</name>
    <type>
      <types>CatalogRef.МВЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийВыдачиСИЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладОтправитель</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>МОЛ</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>МОЛСкладаОтправителя</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>АХ_СтатусСборки</name>
    <type>
      <types>EnumRef.АХ_СтатусыСборкиТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>АХ_ПеремещениеПоПредварительнойСборке</name>
    <type>
      <types>DocumentRef.ПеремещениеНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрисоединенныйФайлМБ7</name>
    <type>
      <types>CatalogRef.ВыдачаСредствЗащитыСотрудникуПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредварительнаяСборка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПеремещатьВсе</name>
    <comment>Задача 23750</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>НеВыдано</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НеВыданоПоПричине</name>
      <type>
        <types>CatalogRef.ПричиныНевыдачиСИЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>НормаВыдачи</name>
      <type>
        <types>CatalogRef.НормыВыдачиСИЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураНормы</name>
      <type>
        <types>CatalogRef.НоменклатураНормОрганизации</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНоменклатуры</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаВыдачи</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПотребность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комплект</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоВКомплекте</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоСовпаденийНоменклатурыНормы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПериодичностьВыдачи</name>
      <comment>Максимальная периодичность выдачи для совпадающих значений номенклатуры нормы</comment>
      <type>
        <types>CatalogRef.ПериодичностьВыдачиСИЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>ДобавленаКопированием</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентИзноса</name>
      <type>
        <types>CatalogRef.ПроцентыИзноса</types>
      </type>
    </attributes>
    <attributes>
      <name>ВыдачаСверхНорм</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерСтрокиКомплекта</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ШтрихкодыНоменклатуры</name>
    <attributes>
      <name>Штрихкод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНоменклатуры</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаВыдачи</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КодыМаркировки</name>
    <attributes>
      <name>КодМаркировки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНоменклатуры</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

astb_relise/src/Documents/УстановкаШтрихкодовНоменклатуры/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства) Экспорт
	
	ТаблицыДляДвижений = ДополнительныеСвойства.ТаблицыДляДвижений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УстановкаШтрихкодовНоменклатурыШтрихкодыНоменклатуры.Ссылка.Организация КАК Организация,
	|	УстановкаШтрихкодовНоменклатурыШтрихкодыНоменклатуры.Штрихкод,
	|	УстановкаШтрихкодовНоменклатурыШтрихкодыНоменклатуры.Ссылка.Сотрудник,
	|	УстановкаШтрихкодовНоменклатурыШтрихкодыНоменклатуры.Ссылка.Подразделение,
	|	УстановкаШтрихкодовНоменклатурыШтрихкодыНоменклатуры.Ссылка.МВЗ,
	|	УстановкаШтрихкодовНоменклатурыШтрихкодыНоменклатуры.Номенклатура,
	|	УстановкаШтрихкодовНоменклатурыШтрихкодыНоменклатуры.ХарактеристикаНоменклатуры,
	|	УстановкаШтрихкодовНоменклатурыШтрихкодыНоменклатуры.ДатаВыдачи
	|ИЗ
	|	Документ.УстановкаШтрихкодовНоменклатуры.ШтрихкодыНоменклатуры КАК УстановкаШтрихкодовНоменклатурыШтрихкодыНоменклатуры
	|ГДЕ
	|	УстановкаШтрихкодовНоменклатурыШтрихкодыНоменклатуры.Ссылка = &Ссылка
	|	И НЕ УстановкаШтрихкодовНоменклатурыШтрихкодыНоменклатуры.Штрихкод = """"";
	
	Запрос.УстановитьПараметр("Ссылка",ДокументСсылка);
	
	ТаблицыДляДвижений.Вставить("ТаблицаШтрихкодыНоменклатурыДляУчетаЧистки", Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры	

Процедура ЗаполнитьТаблицуДокумента(ТекущийОбъект,ПоВсейВыдаче) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТекущийОбъект.ШтрихкодыНоменклатуры.Очистить();
	
	Если ЗначениеЗаполнено(ТекущийОбъект.ДокументОснование) Тогда //заполнение по основанию
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВыданныеСредстваЗащиты.Номенклатура,
		|	ВыданныеСредстваЗащиты.ХарактеристикаНоменклатуры,
		|	СУММА(ВыданныеСредстваЗащиты.Количество) КАК Количество,
		|	ВыданныеСредстваЗащиты.ДатаВыдачи
		|ПОМЕСТИТЬ ВТ_Выдача
		|ИЗ
		|	РегистрНакопления.ВыданныеСредстваЗащиты КАК ВыданныеСредстваЗащиты
		|ГДЕ
		|	ВыданныеСредстваЗащиты.Регистратор = &ДокументОснование
		|
		|СГРУППИРОВАТЬ ПО
		|	ВыданныеСредстваЗащиты.Номенклатура,
		|	ВыданныеСредстваЗащиты.ХарактеристикаНоменклатуры,
		|	ВыданныеСредстваЗащиты.ДатаВыдачи
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НоменклатураКомплектующие.Ссылка КАК Комплект,
		|	НоменклатураКомплектующие.Номенклатура,
		|	НоменклатураКомплектующие.Количество
		|ПОМЕСТИТЬ ВТ_Комплектующие
		|ИЗ
		|	Справочник.Номенклатура.Комплектующие КАК НоменклатураКомплектующие
		|ГДЕ
		|	НоменклатураКомплектующие.Номенклатура.ИспользоватьШтрихкод
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ВТ_Выдача.Номенклатура.Комплект
		|			ТОГДА ВТ_Комплектующие.Номенклатура
		|		ИНАЧЕ ВТ_Выдача.Номенклатура
		|	КОНЕЦ КАК Номенклатура,
		|	ВТ_Выдача.ХарактеристикаНоменклатуры,
		|	ВЫБОР
		|		КОГДА ВТ_Выдача.Номенклатура.Комплект
		|			ТОГДА ВТ_Выдача.Количество * ЕСТЬNULL(ВТ_Комплектующие.Количество, 0)
		|		ИНАЧЕ ВТ_Выдача.Количество
		|	КОНЕЦ КАК Количество,
		|	ВТ_Выдача.ДатаВыдачи
		|ПОМЕСТИТЬ ВТ_ВыдачаСКомплектующими
		|ИЗ
		|	ВТ_Выдача КАК ВТ_Выдача
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Комплектующие КАК ВТ_Комплектующие
		|		ПО ВТ_Выдача.Номенклатура = ВТ_Комплектующие.Комплект
		|ГДЕ
		|	ВЫБОР
		|			КОГДА ВТ_Выдача.Номенклатура.Комплект
		|				ТОГДА НЕ ВТ_Комплектующие.Номенклатура ЕСТЬ NULL 
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	УстановкаШтрихкодовНоменклатурыШтрихкодыНоменклатуры.Штрихкод,
		|	УстановкаШтрихкодовНоменклатурыШтрихкодыНоменклатуры.Номенклатура,
		|	УстановкаШтрихкодовНоменклатурыШтрихкодыНоменклатуры.ХарактеристикаНоменклатуры,
		|	УстановкаШтрихкодовНоменклатурыШтрихкодыНоменклатуры.ДатаВыдачи
		|ИЗ
		|	Документ.УстановкаШтрихкодовНоменклатуры.ШтрихкодыНоменклатуры КАК УстановкаШтрихкодовНоменклатурыШтрихкодыНоменклатуры
		|ГДЕ
		|	УстановкаШтрихкодовНоменклатурыШтрихкодыНоменклатуры.Ссылка.ДокументОснование = &ДокументОснование
		|	И ПОДСТРОКА(УстановкаШтрихкодовНоменклатурыШтрихкодыНоменклатуры.Штрихкод, 6, 7) <= &МаскимальныйШтрихкод
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ВыдачаСКомплектующими.Номенклатура,
		|	ЕСТЬNULL(ХарактеристикиНоменклатуры.Ссылка, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) КАК ХарактеристикаНоменклатуры,
		|	ВТ_ВыдачаСКомплектующими.Количество,
		|	ВТ_ВыдачаСКомплектующими.ДатаВыдачи
		|ИЗ
		|	ВТ_ВыдачаСКомплектующими КАК ВТ_ВыдачаСКомплектующими
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
		|		ПО ВТ_ВыдачаСКомплектующими.Номенклатура = ХарактеристикиНоменклатуры.Владелец
		|			И ВТ_ВыдачаСКомплектующими.ХарактеристикаНоменклатуры.Метрика = ХарактеристикиНоменклатуры.Метрика";
		
		Запрос.УстановитьПараметр("ДокументОснование",		ТекущийОбъект.ДокументОснование);
		Запрос.УстановитьПараметр("МаскимальныйШтрихкод",	Формат(ТекущийОбъект.Организация.МаксимальноеЗначениеШтрихкода,"ЧЦ=7; ЧДЦ=; ЧВН=; ЧГ="));
		
		Результат = Запрос.ВыполнитьПакет();
		
		ТаблицаШтрихкодов 	= Результат[3].Выгрузить();
		ТаблицаВыдачи 		= Результат[4].Выгрузить();
		
		Для Каждого СтрокаТаблицыВыдачи Из ТаблицаВыдачи Цикл
			
			СтруктураПоиска = Новый Структура("Номенклатура, ДатаВыдачи", СтрокаТаблицыВыдачи.Номенклатура, СтрокаТаблицыВыдачи.ДатаВыдачи);
			
			НайденныеСтрокиТаблицаШтрихкодов = ТаблицаШтрихкодов.НайтиСтроки(СтруктураПоиска);
			
			КоличествоШтрихкодов = НайденныеСтрокиТаблицаШтрихкодов.Количество();
			
			Если КоличествоШтрихкодов >= СтрокаТаблицыВыдачи.Количество Тогда
				Продолжить;
			КонецЕсли;	
			
			КоличествоЭкземпляровДляШтрихкодов = СтрокаТаблицыВыдачи.Количество - КоличествоШтрихкодов;
			
			Пока КоличествоЭкземпляровДляШтрихкодов > 0 Цикл
				
				ЗаполнитьЗначенияСвойств(ТекущийОбъект.ШтрихкодыНоменклатуры.Добавить(),СтрокаТаблицыВыдачи);
				
				КоличествоЭкземпляровДляШтрихкодов = КоличествоЭкземпляровДляШтрихкодов - 1;
				
			КонецЦикла;
			
		КонецЦикла;
		
		ЗаполнитьПустыеШтрихкоды(ТекущийОбъект);
		
	Иначе
		
		Запрос = Новый Запрос;
		
		Если ПоВсейВыдаче Тогда
			
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ШтрихкодыНоменклатурыДляУчетаЧистки.Штрихкод,
			|	ШтрихкодыНоменклатурыДляУчетаЧистки.Сотрудник,
			|	ШтрихкодыНоменклатурыДляУчетаЧистки.Номенклатура,
			|	ШтрихкодыНоменклатурыДляУчетаЧистки.ХарактеристикаНоменклатуры,
			|	ШтрихкодыНоменклатурыДляУчетаЧистки.ДатаВыдачи
			|ПОМЕСТИТЬ ВТ_ШтрихкодыИзРегистра
			|ИЗ
			|	РегистрСведений.ШтрихкодыНоменклатурыДляУчетаЧистки КАК ШтрихкодыНоменклатурыДляУчетаЧистки
			|ГДЕ
			|	ШтрихкодыНоменклатурыДляУчетаЧистки.Активность
			|	И ШтрихкодыНоменклатурыДляУчетаЧистки.Сотрудник = &Сотрудник
			|	И ШтрихкодыНоменклатурыДляУчетаЧистки.Организация = &Организация
			|	И НЕ ШтрихкодыНоменклатурыДляУчетаЧистки.Сотрудник = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВыдачаСредствЗащитыСотрудникуШтрихкодыНоменклатуры.Штрихкод,
			|	ВыдачаСредствЗащитыСотрудникуШтрихкодыНоменклатуры.Ссылка.Сотрудник,
			|	ВыдачаСредствЗащитыСотрудникуШтрихкодыНоменклатуры.Номенклатура,
			|	ВыдачаСредствЗащитыСотрудникуШтрихкодыНоменклатуры.ХарактеристикаНоменклатуры,
			|	ВыдачаСредствЗащитыСотрудникуШтрихкодыНоменклатуры.ДатаВыдачи
			|ПОМЕСТИТЬ ВТ_ШтрихкодыИзДокументовВыдачи
			|ИЗ
			|	Документ.ВыдачаСредствЗащитыСотруднику.ШтрихкодыНоменклатуры КАК ВыдачаСредствЗащитыСотрудникуШтрихкодыНоменклатуры
			|ГДЕ
			|	ВыдачаСредствЗащитыСотрудникуШтрихкодыНоменклатуры.Ссылка.Организация = &Организация
			|	И ВыдачаСредствЗащитыСотрудникуШтрихкодыНоменклатуры.Ссылка.Сотрудник = &Сотрудник
			|	И НЕ ВыдачаСредствЗащитыСотрудникуШтрихкодыНоменклатуры.Штрихкод = """"
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	УстановкаШтрихкодовНоменклатурыШтрихкодыНоменклатуры.Штрихкод,
			|	УстановкаШтрихкодовНоменклатурыШтрихкодыНоменклатуры.Ссылка.Сотрудник,
			|	УстановкаШтрихкодовНоменклатурыШтрихкодыНоменклатуры.Номенклатура,
			|	УстановкаШтрихкодовНоменклатурыШтрихкодыНоменклатуры.ХарактеристикаНоменклатуры,
			|	УстановкаШтрихкодовНоменклатурыШтрихкодыНоменклатуры.ДатаВыдачи
			|ПОМЕСТИТЬ ВТ_ШтрихкодыИзДокументовУстановки
			|ИЗ
			|	Документ.УстановкаШтрихкодовНоменклатуры.ШтрихкодыНоменклатуры КАК УстановкаШтрихкодовНоменклатурыШтрихкодыНоменклатуры
			|ГДЕ
			|	УстановкаШтрихкодовНоменклатурыШтрихкодыНоменклатуры.Ссылка.Организация = &Организация
			|	И УстановкаШтрихкодовНоменклатурыШтрихкодыНоменклатуры.Ссылка.Сотрудник = &Сотрудник
			|	И НЕ УстановкаШтрихкодовНоменклатурыШтрихкодыНоменклатуры.Штрихкод = """"
			|	И УстановкаШтрихкодовНоменклатурыШтрихкодыНоменклатуры.Ссылка.Сотрудник = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ЕСТЬNULL(ВТ_ШтрихкодыИзРегистра.Штрихкод, ВТ_ШтрихкодыИзДокументовУстановки.Штрихкод) КАК Штрихкод,
			|	ЕСТЬNULL(ВТ_ШтрихкодыИзРегистра.Сотрудник, ВТ_ШтрихкодыИзДокументовУстановки.Сотрудник) КАК Сотрудник,
			|	ЕСТЬNULL(ВТ_ШтрихкодыИзРегистра.Номенклатура, ВТ_ШтрихкодыИзДокументовУстановки.Номенклатура) КАК Номенклатура,
			|	ЕСТЬNULL(ВТ_ШтрихкодыИзРегистра.ХарактеристикаНоменклатуры, ВТ_ШтрихкодыИзДокументовУстановки.ХарактеристикаНоменклатуры) КАК ХарактеристикаНоменклатуры,
			|	ЕСТЬNULL(ВТ_ШтрихкодыИзРегистра.ДатаВыдачи, ВТ_ШтрихкодыИзДокументовУстановки.ДатаВыдачи) КАК ДатаВыдачи
			|ПОМЕСТИТЬ ВТ_ШтрихкодыИзРегистраИзДокументовУстановки
			|ИЗ
			|	ВТ_ШтрихкодыИзРегистра КАК ВТ_ШтрихкодыИзРегистра
			|		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_ШтрихкодыИзДокументовУстановки КАК ВТ_ШтрихкодыИзДокументовУстановки
			|		ПО ВТ_ШтрихкодыИзРегистра.Штрихкод = ВТ_ШтрихкодыИзДокументовУстановки.Штрихкод
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	НоменклатураКомплектующие.Ссылка КАК Комплект,
			|	НоменклатураКомплектующие.Номенклатура,
			|	НоменклатураКомплектующие.Количество
			|ПОМЕСТИТЬ ВТ_Комплектующие
			|ИЗ
			|	Справочник.Номенклатура.Комплектующие КАК НоменклатураКомплектующие
			|ГДЕ
			|	НоменклатураКомплектующие.Номенклатура.ИспользоватьШтрихкод
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВыданныеСредстваЗащитыОстатки.Сотрудник,
			|	ВыданныеСредстваЗащитыОстатки.Номенклатура,
			|	ВыданныеСредстваЗащитыОстатки.ХарактеристикаНоменклатуры,
			|	ВыданныеСредстваЗащитыОстатки.ДатаВыдачи,
			|	СУММА(ВыданныеСредстваЗащитыОстатки.КоличествоОстаток) КАК КоличествоОстаток
			|ПОМЕСТИТЬ ВТ_Выдача
			|ИЗ
			|	РегистрНакопления.ВыданныеСредстваЗащиты.Остатки(
			|			&ДатаАнализа,
			|			Организация = &Организация
			|				И Номенклатура.ИспользоватьШтрихкод
			|				И ВЫБОР
			|					КОГДА &ВидВыдачи = ЗНАЧЕНИЕ(Перечисление.ВидыВыдачиСИЗ.ПерсональнаяВыдача)
			|						ТОГДА Сотрудник = &Сотрудник
			|					ИНАЧЕ НормаВыдачи = ЗНАЧЕНИЕ(Справочник.НормыВыдачиСИЗ.ПустаяСсылка)
			|				КОНЕЦ) КАК ВыданныеСредстваЗащитыОстатки
			|
			|СГРУППИРОВАТЬ ПО
			|	ВыданныеСредстваЗащитыОстатки.Сотрудник,
			|	ВыданныеСредстваЗащитыОстатки.Номенклатура,
			|	ВыданныеСредстваЗащитыОстатки.ХарактеристикаНоменклатуры,
			|	ВыданныеСредстваЗащитыОстатки.ДатаВыдачи
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ_Выдача.Сотрудник,
			|	ВЫБОР
			|		КОГДА ВТ_Выдача.Номенклатура.Комплект
			|			ТОГДА ВТ_Комплектующие.Номенклатура
			|		ИНАЧЕ ВТ_Выдача.Номенклатура
			|	КОНЕЦ КАК Номенклатура,
			|	ВТ_Выдача.ХарактеристикаНоменклатуры,
			|	ВТ_Выдача.ДатаВыдачи,
			|	ВЫБОР
			|		КОГДА ВТ_Выдача.Номенклатура.Комплект
			|			ТОГДА ВТ_Выдача.КоличествоОстаток * ЕСТЬNULL(ВТ_Комплектующие.Количество, 0)
			|		ИНАЧЕ ВТ_Выдача.КоличествоОстаток
			|	КОНЕЦ КАК КоличествоОстаток
			|ПОМЕСТИТЬ ВТ_ВыдачаСКомплектующими
			|ИЗ
			|	ВТ_Выдача КАК ВТ_Выдача
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Комплектующие КАК ВТ_Комплектующие
			|		ПО ВТ_Выдача.Номенклатура = ВТ_Комплектующие.Комплект
			|ГДЕ
			|	ВЫБОР
			|			КОГДА ВТ_Выдача.Номенклатура.Комплект
			|				ТОГДА НЕ ВТ_Комплектующие.Номенклатура ЕСТЬ NULL 
			|			ИНАЧЕ ИСТИНА
			|		КОНЕЦ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ЕСТЬNULL(ВТ_ШтрихкодыИзРегистраИзДокументовУстановки.Штрихкод, ВТ_ШтрихкодыИзДокументовВыдачи.Штрихкод) КАК Штрихкод,
			|	ВЫБОР
			|		КОГДА ВТ_ШтрихкодыИзРегистраИзДокументовУстановки.Сотрудник ЕСТЬ NULL 
			|			ТОГДА ЕСТЬNULL(ВТ_ШтрихкодыИзДокументовВыдачи.Сотрудник, ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка))
			|		ИНАЧЕ ВТ_ШтрихкодыИзРегистраИзДокументовУстановки.Сотрудник
			|	КОНЕЦ КАК Сотрудник,
			|	ЕСТЬNULL(ВТ_ШтрихкодыИзРегистраИзДокументовУстановки.Номенклатура, ВТ_ШтрихкодыИзДокументовВыдачи.Номенклатура) КАК Номенклатура,
			|	ЕСТЬNULL(ВТ_ШтрихкодыИзРегистраИзДокументовУстановки.ХарактеристикаНоменклатуры, ВТ_ШтрихкодыИзДокументовВыдачи.ХарактеристикаНоменклатуры) КАК ХарактеристикаНоменклатуры,
			|	ЕСТЬNULL(ВТ_ШтрихкодыИзРегистраИзДокументовУстановки.ДатаВыдачи, ВТ_ШтрихкодыИзДокументовВыдачи.ДатаВыдачи) КАК ДатаВыдачи
			|ИЗ
			|	ВТ_ШтрихкодыИзРегистраИзДокументовУстановки КАК ВТ_ШтрихкодыИзРегистраИзДокументовУстановки
			|		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_ШтрихкодыИзДокументовВыдачи КАК ВТ_ШтрихкодыИзДокументовВыдачи
			|		ПО ВТ_ШтрихкодыИзРегистраИзДокументовУстановки.Штрихкод = ВТ_ШтрихкодыИзДокументовВыдачи.Штрихкод
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ_ВыдачаСКомплектующими.Сотрудник,
			|	ВТ_ВыдачаСКомплектующими.Номенклатура,
			|	ЕСТЬNULL(ВТ_ВыдачаСКомплектующими.ХарактеристикаНоменклатуры, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) КАК ХарактеристикаНоменклатуры,
			|	ВТ_ВыдачаСКомплектующими.ДатаВыдачи,
			|	ВТ_ВыдачаСКомплектующими.КоличествоОстаток
			|ИЗ
			|	ВТ_ВыдачаСКомплектующими КАК ВТ_ВыдачаСКомплектующими
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
			|		ПО ВТ_ВыдачаСКомплектующими.Номенклатура = ХарактеристикиНоменклатуры.Владелец
			|			И ВТ_ВыдачаСКомплектующими.ХарактеристикаНоменклатуры.Метрика = ХарактеристикиНоменклатуры.Метрика";
			
		Иначе
			
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ШтрихкодыНоменклатурыДляУчетаЧистки.Штрихкод КАК Штрихкод,
			|	ШтрихкодыНоменклатурыДляУчетаЧистки.Сотрудник КАК Сотрудник,
			|	ШтрихкодыНоменклатурыДляУчетаЧистки.Номенклатура КАК Номенклатура,
			|	ШтрихкодыНоменклатурыДляУчетаЧистки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
			|	ШтрихкодыНоменклатурыДляУчетаЧистки.ДатаВыдачи КАК ДатаВыдачи
			|ПОМЕСТИТЬ ВТ_ШтрихкодыИзРегистра
			|ИЗ
			|	РегистрСведений.ШтрихкодыНоменклатурыДляУчетаЧистки КАК ШтрихкодыНоменклатурыДляУчетаЧистки
			|ГДЕ
			|	ШтрихкодыНоменклатурыДляУчетаЧистки.Активность
			|	И ШтрихкодыНоменклатурыДляУчетаЧистки.Сотрудник = &Сотрудник
			|	И ШтрихкодыНоменклатурыДляУчетаЧистки.Организация = &Организация
			|	И НЕ ШтрихкодыНоменклатурыДляУчетаЧистки.Сотрудник = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВыдачаСредствЗащитыСотрудникуШтрихкодыНоменклатуры.Штрихкод КАК Штрихкод,
			|	ВыдачаСредствЗащитыСотрудникуШтрихкодыНоменклатуры.Ссылка.Сотрудник КАК Сотрудник,
			|	ВыдачаСредствЗащитыСотрудникуШтрихкодыНоменклатуры.Номенклатура КАК Номенклатура,
			|	ВыдачаСредствЗащитыСотрудникуШтрихкодыНоменклатуры.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
			|	ВыдачаСредствЗащитыСотрудникуШтрихкодыНоменклатуры.ДатаВыдачи КАК ДатаВыдачи
			|ПОМЕСТИТЬ ВТ_ШтрихкодыИзДокументовВыдачи
			|ИЗ
			|	Документ.ВыдачаСредствЗащитыСотруднику.ШтрихкодыНоменклатуры КАК ВыдачаСредствЗащитыСотрудникуШтрихкодыНоменклатуры
			|ГДЕ
			|	ВыдачаСредствЗащитыСотрудникуШтрихкодыНоменклатуры.Ссылка.Организация = &Организация
			|	И ВыдачаСредствЗащитыСотрудникуШтрихкодыНоменклатуры.Ссылка.Сотрудник = &Сотрудник
			|	И НЕ ВыдачаСредствЗащитыСотрудникуШтрихкодыНоменклатуры.Штрихкод = """"
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	УстановкаШтрихкодовНоменклатурыШтрихкодыНоменклатуры.Штрихкод КАК Штрихкод,
			|	УстановкаШтрихкодовНоменклатурыШтрихкодыНоменклатуры.Ссылка.Сотрудник КАК Сотрудник,
			|	УстановкаШтрихкодовНоменклатурыШтрихкодыНоменклатуры.Номенклатура КАК Номенклатура,
			|	УстановкаШтрихкодовНоменклатурыШтрихкодыНоменклатуры.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
			|	УстановкаШтрихкодовНоменклатурыШтрихкодыНоменклатуры.ДатаВыдачи КАК ДатаВыдачи
			|ПОМЕСТИТЬ ВТ_ШтрихкодыИзДокументовУстановки
			|ИЗ
			|	Документ.УстановкаШтрихкодовНоменклатуры.ШтрихкодыНоменклатуры КАК УстановкаШтрихкодовНоменклатурыШтрихкодыНоменклатуры
			|ГДЕ
			|	УстановкаШтрихкодовНоменклатурыШтрихкодыНоменклатуры.Ссылка.Организация = &Организация
			|	И УстановкаШтрихкодовНоменклатурыШтрихкодыНоменклатуры.Ссылка.Сотрудник = &Сотрудник
			|	И НЕ УстановкаШтрихкодовНоменклатурыШтрихкодыНоменклатуры.Штрихкод = """"
			|	И УстановкаШтрихкодовНоменклатурыШтрихкодыНоменклатуры.Ссылка.Сотрудник = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ЕСТЬNULL(ВТ_ШтрихкодыИзРегистра.Штрихкод, ВТ_ШтрихкодыИзДокументовУстановки.Штрихкод) КАК Штрихкод,
			|	ЕСТЬNULL(ВТ_ШтрихкодыИзРегистра.Сотрудник, ВТ_ШтрихкодыИзДокументовУстановки.Сотрудник) КАК Сотрудник,
			|	ЕСТЬNULL(ВТ_ШтрихкодыИзРегистра.Номенклатура, ВТ_ШтрихкодыИзДокументовУстановки.Номенклатура) КАК Номенклатура,
			|	ЕСТЬNULL(ВТ_ШтрихкодыИзРегистра.ХарактеристикаНоменклатуры, ВТ_ШтрихкодыИзДокументовУстановки.ХарактеристикаНоменклатуры) КАК ХарактеристикаНоменклатуры,
			|	ЕСТЬNULL(ВТ_ШтрихкодыИзРегистра.ДатаВыдачи, ВТ_ШтрихкодыИзДокументовУстановки.ДатаВыдачи) КАК ДатаВыдачи
			|ПОМЕСТИТЬ ВТ_ШтрихкодыИзРегистраИзДокументовУстановки
			|ИЗ
			|	ВТ_ШтрихкодыИзРегистра КАК ВТ_ШтрихкодыИзРегистра
			|		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_ШтрихкодыИзДокументовУстановки КАК ВТ_ШтрихкодыИзДокументовУстановки
			|		ПО ВТ_ШтрихкодыИзРегистра.Штрихкод = ВТ_ШтрихкодыИзДокументовУстановки.Штрихкод
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	НоменклатураКомплектующие.Ссылка КАК Комплект,
			|	НоменклатураКомплектующие.Номенклатура КАК Номенклатура,
			|	НоменклатураКомплектующие.Количество КАК Количество
			|ПОМЕСТИТЬ ВТ_Комплектующие
			|ИЗ
			|	Справочник.Номенклатура.Комплектующие КАК НоменклатураКомплектующие
			|ГДЕ
			|	НоменклатураКомплектующие.Номенклатура.ИспользоватьШтрихкод
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВыданныеСредстваЗащитыОстатки.Сотрудник КАК Сотрудник,
			|	ВыданныеСредстваЗащитыОстатки.Номенклатура КАК Номенклатура,
			|	ВыданныеСредстваЗащитыОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
			|	ВыданныеСредстваЗащитыОстатки.ДатаВыдачи КАК ДатаВыдачи,
			|	СУММА(ВыданныеСредстваЗащитыОстатки.КоличествоОстаток) КАК КоличествоОстаток
			|ПОМЕСТИТЬ ВТ_Выдача
			|ИЗ
			|	РегистрНакопления.ВыданныеСредстваЗащиты.Остатки(
			|			&ДатаАнализа,
			|			Организация = &Организация
			|				И Номенклатура.ИспользоватьШтрихкод
			|				И ВЫБОР
			|					КОГДА &ВидВыдачи = ЗНАЧЕНИЕ(Перечисление.ВидыВыдачиСИЗ.ПерсональнаяВыдача)
			|						ТОГДА Сотрудник = &Сотрудник
			|					ИНАЧЕ НормаВыдачи = ЗНАЧЕНИЕ(Справочник.НормыВыдачиСИЗ.ПустаяСсылка)
			|				КОНЕЦ) КАК ВыданныеСредстваЗащитыОстатки
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НормыВыдачиСИЗ.СоставНормы КАК НормыВыдачиСИЗСоставНормы
			|		ПО ВыданныеСредстваЗащитыОстатки.НормаВыдачи = НормыВыдачиСИЗСоставНормы.Ссылка
			|			И ВыданныеСредстваЗащитыОстатки.НоменклатураНормы = НормыВыдачиСИЗСоставНормы.НоменклатураНормы
			|ГДЕ
			|	ВЫБОР
			|			КОГДА ВыданныеСредстваЗащитыОстатки.НормаВыдачи = ЗНАЧЕНИЕ(Справочник.НормыВыдачиСИЗ.ПустаяСсылка)
			|				ТОГДА ИСТИНА
			|			ИНАЧЕ ВЫБОР
			|					КОГДА НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи = ЗНАЧЕНИЕ(Справочник.ПериодичностьВыдачиСИЗ.ПустаяСсылка)
			|						ТОГДА ИСТИНА
			|					ИНАЧЕ ВЫБОР
			|							КОГДА НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.ТипПериода = ЗНАЧЕНИЕ(Перечисление.ДоступныеПериодыОтчета.Год)
			|								ТОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ВыданныеСредстваЗащитыОстатки.ДатаВыдачи, МЕСЯЦ, НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.КоличествоПериодов * 12), МЕСЯЦ) > НАЧАЛОПЕРИОДА(&ДатаДокумента, МЕСЯЦ)
			|							ИНАЧЕ НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ВыданныеСредстваЗащитыОстатки.ДатаВыдачи, МЕСЯЦ, НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.КоличествоПериодов), МЕСЯЦ) > НАЧАЛОПЕРИОДА(&ДатаДокумента, МЕСЯЦ)
			|						КОНЕЦ
			|				КОНЕЦ
			|		КОНЕЦ
			|
			|СГРУППИРОВАТЬ ПО
			|	ВыданныеСредстваЗащитыОстатки.Сотрудник,
			|	ВыданныеСредстваЗащитыОстатки.Номенклатура,
			|	ВыданныеСредстваЗащитыОстатки.ХарактеристикаНоменклатуры,
			|	ВыданныеСредстваЗащитыОстатки.ДатаВыдачи
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ_Выдача.Сотрудник КАК Сотрудник,
			|	ВЫБОР
			|		КОГДА ВТ_Выдача.Номенклатура.Комплект
			|			ТОГДА ВТ_Комплектующие.Номенклатура
			|		ИНАЧЕ ВТ_Выдача.Номенклатура
			|	КОНЕЦ КАК Номенклатура,
			|	ВТ_Выдача.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
			|	ВТ_Выдача.ДатаВыдачи КАК ДатаВыдачи,
			|	ВЫБОР
			|		КОГДА ВТ_Выдача.Номенклатура.Комплект
			|			ТОГДА ВТ_Выдача.КоличествоОстаток * ЕСТЬNULL(ВТ_Комплектующие.Количество, 0)
			|		ИНАЧЕ ВТ_Выдача.КоличествоОстаток
			|	КОНЕЦ КАК КоличествоОстаток
			|ПОМЕСТИТЬ ВТ_ВыдачаСКомплектующими
			|ИЗ
			|	ВТ_Выдача КАК ВТ_Выдача
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Комплектующие КАК ВТ_Комплектующие
			|		ПО ВТ_Выдача.Номенклатура = ВТ_Комплектующие.Комплект
			|ГДЕ
			|	ВЫБОР
			|			КОГДА ВТ_Выдача.Номенклатура.Комплект
			|				ТОГДА НЕ ВТ_Комплектующие.Номенклатура ЕСТЬ NULL
			|			ИНАЧЕ ИСТИНА
			|		КОНЕЦ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ЕСТЬNULL(ВТ_ШтрихкодыИзРегистраИзДокументовУстановки.Штрихкод, ВТ_ШтрихкодыИзДокументовВыдачи.Штрихкод) КАК Штрихкод,
			|	ВЫБОР
			|		КОГДА ВТ_ШтрихкодыИзРегистраИзДокументовУстановки.Сотрудник ЕСТЬ NULL
			|			ТОГДА ЕСТЬNULL(ВТ_ШтрихкодыИзДокументовВыдачи.Сотрудник, ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка))
			|		ИНАЧЕ ВТ_ШтрихкодыИзРегистраИзДокументовУстановки.Сотрудник
			|	КОНЕЦ КАК Сотрудник,
			|	ЕСТЬNULL(ВТ_ШтрихкодыИзРегистраИзДокументовУстановки.Номенклатура, ВТ_ШтрихкодыИзДокументовВыдачи.Номенклатура) КАК Номенклатура,
			|	ЕСТЬNULL(ВТ_ШтрихкодыИзРегистраИзДокументовУстановки.ХарактеристикаНоменклатуры, ВТ_ШтрихкодыИзДокументовВыдачи.ХарактеристикаНоменклатуры) КАК ХарактеристикаНоменклатуры,
			|	ЕСТЬNULL(ВТ_ШтрихкодыИзРегистраИзДокументовУстановки.ДатаВыдачи, ВТ_ШтрихкодыИзДокументовВыдачи.ДатаВыдачи) КАК ДатаВыдачи
			|ИЗ
			|	ВТ_ШтрихкодыИзРегистраИзДокументовУстановки КАК ВТ_ШтрихкодыИзРегистраИзДокументовУстановки
			|		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_ШтрихкодыИзДокументовВыдачи КАК ВТ_ШтрихкодыИзДокументовВыдачи
			|		ПО ВТ_ШтрихкодыИзРегистраИзДокументовУстановки.Штрихкод = ВТ_ШтрихкодыИзДокументовВыдачи.Штрихкод
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ_ВыдачаСКомплектующими.Сотрудник КАК Сотрудник,
			|	ВТ_ВыдачаСКомплектующими.Номенклатура КАК Номенклатура,
			|	ЕСТЬNULL(ВТ_ВыдачаСКомплектующими.ХарактеристикаНоменклатуры, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) КАК ХарактеристикаНоменклатуры,
			|	ВТ_ВыдачаСКомплектующими.ДатаВыдачи КАК ДатаВыдачи,
			|	ВТ_ВыдачаСКомплектующими.КоличествоОстаток КАК КоличествоОстаток
			|ИЗ
			|	ВТ_ВыдачаСКомплектующими КАК ВТ_ВыдачаСКомплектующими
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
			|		ПО ВТ_ВыдачаСКомплектующими.Номенклатура = ХарактеристикиНоменклатуры.Владелец
			|			И ВТ_ВыдачаСКомплектующими.ХарактеристикаНоменклатуры.Метрика = ХарактеристикиНоменклатуры.Метрика";			
			
		КонецЕсли;
		
		Запрос.УстановитьПараметр("ВидВыдачи",		ТекущийОбъект.ВидВыдачиСИЗ);
		Запрос.УстановитьПараметр("Сотрудник",		ТекущийОбъект.Сотрудник);
		Запрос.УстановитьПараметр("Подразделение",	ТекущийОбъект.Подразделение);
		Запрос.УстановитьПараметр("МВЗ",			ТекущийОбъект.МВЗ);
		Запрос.УстановитьПараметр("Организация",	ТекущийОбъект.Организация);
		Запрос.УстановитьПараметр("ДатаДокумента",	?(ЗначениеЗаполнено(ТекущийОбъект.Дата),ТекущийОбъект.Дата,ТекущаяДата()));
		Запрос.УстановитьПараметр("ДатаАнализа",	ПроцедурыРаботыСНормамиСервер.ПолучитьГраницуАнализаПоДокументу(ТекущийОбъект.Ссылка));
		
		Результат = Запрос.ВыполнитьПакет();
		
		ТаблицаШтрихкодов 	= Результат[7].Выгрузить();
		ТаблицаВыдачи 		= Результат[8].Выгрузить();
		
		Для Каждого СтрокаТаблицыВыдачи Из ТаблицаВыдачи Цикл
			
			СтруктураПоиска = Новый Структура("Сотрудник, Номенклатура, ДатаВыдачи",
			СтрокаТаблицыВыдачи.Сотрудник, СтрокаТаблицыВыдачи.Номенклатура, СтрокаТаблицыВыдачи.ДатаВыдачи);
			
			НайденныеСтрокиТаблицаШтрихкодов = ТаблицаШтрихкодов.НайтиСтроки(СтруктураПоиска);
			
			КоличествоШтрихкодов = НайденныеСтрокиТаблицаШтрихкодов.Количество();
			
			Если КоличествоШтрихкодов >= СтрокаТаблицыВыдачи.КоличествоОстаток Тогда
				Продолжить;
			КонецЕсли;	
			
			КоличествоЭкземпляровДляШтрихкодов = СтрокаТаблицыВыдачи.КоличествоОстаток - КоличествоШтрихкодов;
			
			Пока КоличествоЭкземпляровДляШтрихкодов > 0 Цикл
				
				ЗаполнитьЗначенияСвойств(ТекущийОбъект.ШтрихкодыНоменклатуры.Добавить(),СтрокаТаблицыВыдачи);
				
				КоличествоЭкземпляровДляШтрихкодов = КоличествоЭкземпляровДляШтрихкодов - 1;
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЕсли;

КонецПроцедуры

Процедура ЗаполнитьПустыеШтрихкоды(ТекущийОбъект) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	МаксимальноеЗначениеШтрихкода = ТекущийОбъект.Организация.МаксимальноеЗначениеШтрихкода;
	
	Для Каждого СтрокаТаблицыШтрихкодов Из ТекущийОбъект.ШтрихкодыНоменклатуры Цикл
		
		Если ЗначениеЗаполнено(СтрокаТаблицыШтрихкодов.Штрихкод) Тогда
			Продолжить;
		КонецЕсли;	
		
		МаксимальноеЗначениеШтрихкода = МаксимальноеЗначениеШтрихкода + 1;
		
		СтрокаТаблицыШтрихкодов.Штрихкод = РегистрыСведений.ШтрихкодыНоменклатурыДляУчетаЧистки.ПолучитьШтрихкодПоКоду(МаксимальноеЗначениеШтрихкода,"2",ТекущийОбъект.Организация.ПрефиксШтрихкодаНоменклатуры);
		
	КонецЦикла;
	
КонецПроцедуры

// Функция помещает необходимые данные в структуру. Структура помещается во временное хранилище
//
// Возвращаемое значение:
//	Адрес   - адрес структуры данных во временном хранилище
//
Функция ПолучитьДанныеДляПечатиЭтикеток(МассивДокументов) Экспорт
	
	//Танцюра А.Н. -- №129655 BUG: одновременная установка штрихкодов -- 02.11.2021 <<<
	
	ТекстСообщения = "Документы: ";
	
	ЕстьНепроведенные = Ложь;
	
	Для Каждого ТекущийДокумент Из МассивДокументов Цикл
		
		Если НЕ ТекущийДокумент.Проведен Тогда
			
			ЕстьНепроведенные = Истина;
			
			ТекстСообщения = ТекстСообщения + Символы.ПС + ТекущийДокумент;
			
		КонецЕсли;	
		
	КонецЦикла;	
	
	ТекстСообщения = ТекстСообщения + Символы.ПС + "не проведены. Печать этикеток невозможна.";
	
	Если ЕстьНепроведенные Тогда
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.Текст = ТекстСообщения;
		СообщениеПользователю.Сообщить();
	КонецЕсли;	
	
	//Танцюра А.Н. -- №129655 BUG: одновременная установка штрихкодов -- 02.11.2021 >>>
	
	УстановитьПривилегированныйРежим(Истина);
	
	МассивСотрудников = Новый Массив;
	
	Для Каждого ТекущийДокумент Из МассивДокументов Цикл
		Если ТекущийДокумент.Организация.ОтображатьДатуОкончанияСрокаНоскиНаЭтикетках 
			И ТекущийДокумент.ВидВыдачиСИЗ = Перечисления.ВидыВыдачиСИЗ.ПерсональнаяВыдача 
			И ЗначениеЗаполнено(ТекущийДокумент.Сотрудник) Тогда
			МассивСотрудников.Добавить(ТекущийДокумент.Сотрудник);
		КонецЕсли;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ШтрихкодыНоменклатурыДляУчетаЧистки.Штрихкод КАК Штрихкод,
	|	ШтрихкодыНоменклатурыДляУчетаЧистки.Сотрудник КАК Сотрудник,
	|	ШтрихкодыНоменклатурыДляУчетаЧистки.Подразделение КАК Подразделение,
	|	ШтрихкодыНоменклатурыДляУчетаЧистки.МВЗ КАК МВЗ,
	|	ШтрихкодыНоменклатурыДляУчетаЧистки.Номенклатура КАК Номенклатура,
	|	ШтрихкодыНоменклатурыДляУчетаЧистки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ШтрихкодыНоменклатурыДляУчетаЧистки.ДатаВыдачи КАК ДатаВыдачи
	|ПОМЕСТИТЬ ВТ_Штрихкоды
	|ИЗ
	|	РегистрСведений.ШтрихкодыНоменклатурыДляУчетаЧистки КАК ШтрихкодыНоменклатурыДляУчетаЧистки
	|ГДЕ
	|	ШтрихкодыНоменклатурыДляУчетаЧистки.Регистратор В(&МассивДокументов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НоменклатураКомплектующие.Ссылка КАК Комплект,
	|	НоменклатураКомплектующие.Номенклатура
	|ПОМЕСТИТЬ ВТ_Комплектующие
	|ИЗ
	|	Справочник.Номенклатура.Комплектующие КАК НоменклатураКомплектующие
	|ГДЕ
	|	НоменклатураКомплектующие.Номенклатура.ИспользоватьШтрихкод
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВыданныеСредстваЗащитыОстатки.Сотрудник,
	|	ВыданныеСредстваЗащитыОстатки.Номенклатура,
	|	ВыданныеСредстваЗащитыОстатки.ДатаВыдачи,
	|	ВЫБОР
	|		КОГДА НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.ТипПериода = ЗНАЧЕНИЕ(Перечисление.ДоступныеПериодыОтчета.Год)
	|			ТОГДА ДОБАВИТЬКДАТЕ(ВыданныеСредстваЗащитыОстатки.ДатаВыдачи, МЕСЯЦ, НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.КоличествоПериодов * 12)
	|		ИНАЧЕ ДОБАВИТЬКДАТЕ(ВыданныеСредстваЗащитыОстатки.ДатаВыдачи, МЕСЯЦ, НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.КоличествоПериодов)
	|	КОНЕЦ КАК ДатаОкончанияИспользования
	|ПОМЕСТИТЬ ВТ_ВыдачаСПериодичностью
	|ИЗ
	|	РегистрНакопления.ВыданныеСредстваЗащиты.Остатки(, Сотрудник В (&МассивСотрудников)) КАК ВыданныеСредстваЗащитыОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НормыВыдачиСИЗ.СоставНормы КАК НормыВыдачиСИЗСоставНормы
	|		ПО ВыданныеСредстваЗащитыОстатки.НормаВыдачи = НормыВыдачиСИЗСоставНормы.Ссылка
	|			И ВыданныеСредстваЗащитыОстатки.НоменклатураНормы = НормыВыдачиСИЗСоставНормы.НоменклатураНормы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВыдачаСПериодичностью.Сотрудник,
	|	ВЫБОР
	|		КОГДА ВТ_ВыдачаСПериодичностью.Номенклатура.Комплект
	|			ТОГДА ВТ_Комплектующие.Номенклатура
	|		ИНАЧЕ ВТ_ВыдачаСПериодичностью.Номенклатура
	|	КОНЕЦ КАК Номенклатура,
	|	ВТ_ВыдачаСПериодичностью.ДатаВыдачи,
	|	ВТ_ВыдачаСПериодичностью.ДатаОкончанияИспользования
	|ПОМЕСТИТЬ ВТ_ВыдачаСКомплектующими
	|ИЗ
	|	ВТ_ВыдачаСПериодичностью КАК ВТ_ВыдачаСПериодичностью
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Комплектующие КАК ВТ_Комплектующие
	|		ПО ВТ_ВыдачаСПериодичностью.Номенклатура = ВТ_Комплектующие.Комплект
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ВТ_ВыдачаСПериодичностью.Номенклатура.Комплект
	|				ТОГДА НЕ ВТ_Комплектующие.Номенклатура ЕСТЬ NULL 
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Штрихкоды.Штрихкод,
	|	ВТ_Штрихкоды.Сотрудник,
	|	ВТ_Штрихкоды.Подразделение,
	|	ВТ_Штрихкоды.МВЗ,
	|	ВТ_Штрихкоды.Номенклатура,
	|	ВТ_Штрихкоды.ХарактеристикаНоменклатуры,
	|	ВТ_Штрихкоды.ДатаВыдачи,
	|	ЕСТЬNULL(ВТ_ВыдачаСКомплектующими.ДатаОкончанияИспользования, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) КАК ДатаОкончанияИспользования
	|ИЗ
	|	ВТ_Штрихкоды КАК ВТ_Штрихкоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВыдачаСКомплектующими КАК ВТ_ВыдачаСКомплектующими
	|		ПО ВТ_Штрихкоды.Сотрудник = ВТ_ВыдачаСКомплектующими.Сотрудник
	|			И ВТ_Штрихкоды.Номенклатура = ВТ_ВыдачаСКомплектующими.Номенклатура
	|			И ВТ_Штрихкоды.ДатаВыдачи = ВТ_ВыдачаСКомплектующими.ДатаВыдачи";	
	
	Запрос.УстановитьПараметр("МассивДокументов", 	МассивДокументов);
	Запрос.УстановитьПараметр("МассивСотрудников", 	МассивСотрудников);
	
	СтруктураРезультат = Новый Структура;
	СтруктураРезультат.Вставить("ИсходныеДанные", Запрос.Выполнить().Выгрузить());
	
	Возврат ПоместитьВоВременноеХранилище(СтруктураРезультат);
	
КонецФункции 

Процедура ЗаполнитьДокумент(ДанныеЗаполнения,ЭтотОбъект) Экспорт
	
	Основание = ДанныеЗаполнения.Ссылка;
	
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.ВыдачаСредствЗащитыСотруднику") Тогда
		
		ЭтотОбъект.ВидВыдачиСИЗ			= Перечисления.ВидыВыдачиСИЗ.ПроизвольнаяВыдача;
		ЭтотОбъект.Организация 			= ДанныеЗаполнения.Организация;
		ЭтотОбъект.МВЗ 					= ДанныеЗаполнения.МВЗ;
		ЭтотОбъект.ДокументОснование 	= Основание;
		
		ЗаполнитьТаблицуДокумента(ЭтотОбъект,Истина);
	
	КонецЕсли;
	
КонецПроцедуры

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	//КомандаПечати = КомандыПечати.Добавить();
	//КомандаПечати.Идентификатор = "УстановкаШтрихкодовНоменклатуры";
	//КомандаПечати.Представление = НСтр("ru = 'Установка штрихкодов номенклатуры'");
	
КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	
	
КонецПроцедуры

#КонецЕсли
